artillery/artillery.yml
config:
  target: 'http://localhost:3003'  # URL of the target system
  phases:
    - duration: 20
      arrivalRate: 1
    - duration: 20
      arrivalRate: 10
    - duration: 20
      arrivalRate: 100
    - duration: 20
      arrivalRate: 1000
  http:
    timeout: 20
  plugins:
    fake-data: {}
    ensure: {}
    apdex: {}
    expect: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
  processor: "./artillery-functions.js"


scenarios:
  - name: "Reads"
    flow:
      - get:
          name: "Get questions"
          url: "/qa/questions"
          qs:
            product_id: "{{ 1 }}"
            page: "{{ $randomNumber(1, 10) }}"
            count: "{{ $randomNumber(1, 20) }}"
          expect:
            - statusCode: 200
            - contentType: json
      - get:
          name: "Get answers"
          url: "/qa/questions/{{ $randomNumber(6191374, 6879304) }}/answers"

  - name: "Writes"
    flow:
     - post:
          name: "Create question"
          url: "/qa/questions"
          qs:
            body: '{{ $randCatchPhrase() }}'
            name: '{{ $randFullName() }}'
            email: '{{ $randEmail() }}'
            product_id: '{{ $randomNumber(3167733, 3519703) }}'
          expect:
            - statusCode: 201
     - post:
          name: "Create answer"
          url: "/qa/questions/{{ $randomNumber(6191374, 6879304) }}/answers"
          qs:
            body: '{{ $randCatchPhrase() }}'
            name: '{{ $randFullName() }}'
            email: '{{ $randEmail() }}'
            photos: '["http://example.com/image1.jpg", "http://example.com/image2.jpg", "http://example.com/image1.jpg"]'
            product_id: '{{ $randomNumber(3167733, 3519703) }}'
          expect:
            - statusCode: 201
  - name: "Puts"
    flow:
      - put:
          name: "Mark question helpful"
          url: "/qa/questions/{{ $randomNumber(3167733, 3519703) }}/helpful"
          expect:
            - statusCode: 204
      - put:
          name: "Report question"
          url: "/qa/questions/{{ $randomNumber(3167733, 3519703) }}/report"
          expect:
            - statusCode: 204
      - put:
          name: "Mark answer helpful"
          url: "/qa/answers/{{ $randomNumber(6191374, 6879304) }}/helpful"
          expect:
            - statusCode: 204
      - put:
          name: "Report answer"
          url: "/qa/answers/{{ $randomNumber(6191374, 6879304) }}/report"
          expect:
            - statusCode: 204